espressif/esp-idf/components/soc/esp32h2/include/soc/sensitive_struct.h
// Copyright 2020 Espressif Systems (Shanghai) PTE LTD
//
// Licensed under the Apache License, Version 2.0 (the "License");
// you may not use this file except in compliance with the License.
// You may obtain a copy of the License at
//
//     http://www.apache.org/licenses/LICENSE-2.0
//
// Unless required by applicable law or agreed to in writing, software
// distributed under the License is distributed on an "AS IS" BASIS,
// WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
// See the License for the specific language governing permissions and
// limitations under the License.
#ifndef _SOC_SENSITIVE_STRUCT_H_
#define _SOC_SENSITIVE_STRUCT_H_


#ifdef __cplusplus
extern "C" {
#endif
#include "soc.h"

typedef volatile struct {
    union {
        struct {
            uint32_t reg_rom_table_lock            :    1;  /*rom_table_lock*/
            uint32_t reserved1                     :    31;
        };
        uint32_t val;
    } rom_table_lock;
    uint32_t rom_table;
    union {
        struct {
            uint32_t reg_privilege_mode_sel_lock   :    1;  /*privilege_mode_sel_lock*/
            uint32_t reserved1                     :    31;
        };
        uint32_t val;
    } privilege_mode_sel_lock;
    union {
        struct {
            uint32_t reg_privilege_mode_sel        :    1;  /*privilege_mode_sel*/
            uint32_t reserved1                     :    31;
        };
        uint32_t val;
    } privilege_mode_sel;
    union {
        struct {
            uint32_t reg_apb_peripheral_access_lock:    1;  /*apb_peripheral_access_lock*/
            uint32_t reserved1                     :    31;
        };
        uint32_t val;
    } apb_peripheral_access_0;
    union {
        struct {
            uint32_t reg_apb_peripheral_access_split_burst:    1;  /*apb_peripheral_access_split_burst*/
            uint32_t reserved1                     :    31;
        };
        uint32_t val;
    } apb_peripheral_access_1;
    union {
        struct {
            uint32_t reg_internal_sram_usage_lock  :    1;  /*internal_sram_usage_lock*/
            uint32_t reserved1                     :    31;
        };
        uint32_t val;
    } internal_sram_usage_0;
    union {
        struct {
            uint32_t reg_internal_sram_usage_cpu_cache:    1;  /*internal_sram_usage_cpu_cache*/
            uint32_t reg_internal_sram_usage_cpu_sram:    3;  /*internal_sram_usage_cpu_sram*/
            uint32_t reserved4                     :    28;
        };
        uint32_t val;
    } internal_sram_usage_1;
    union {
        struct {
            uint32_t reg_internal_sram_usage_mac_dump_sram:    3;  /*internal_sram_usage_mac_dump_sram*/
            uint32_t reg_internal_sram_alloc_mac_dump:    1;  /*internal_sram_alloc_mac_dump*/
            uint32_t reserved4                     :    28;
        };
        uint32_t val;
    } internal_sram_usage_3;
    union {
        struct {
            uint32_t reg_internal_sram_usage_log_sram:    1;  /*internal_sram_usage_log_sram*/
            uint32_t reserved1                     :    31;
        };
        uint32_t val;
    } internal_sram_usage_4;
    union {
        struct {
            uint32_t reg_cache_tag_access_lock     :    1;  /*cache_tag_access_lock*/
            uint32_t reserved1                     :    31;
        };
        uint32_t val;
    } cache_tag_access_0;
    union {
        struct {
            uint32_t reg_pro_i_tag_rd_acs          :    1;  /*pro_i_tag_rd_acs*/
            uint32_t reg_pro_i_tag_wr_acs          :    1;  /*pro_i_tag_wr_acs*/
            uint32_t reg_pro_d_tag_rd_acs          :    1;  /*pro_d_tag_rd_acs*/
            uint32_t reg_pro_d_tag_wr_acs          :    1;  /*pro_d_tag_wr_acs*/
            uint32_t reserved4                     :    28;
        };
        uint32_t val;
    } cache_tag_access_1;
    union {
        struct {
            uint32_t reg_cache_mmu_access_lock     :    1;  /*cache_mmu_access_lock*/
            uint32_t reserved1                     :    31;
        };
        uint32_t val;
    } cache_mmu_access_0;
    union {
        struct {
            uint32_t reg_pro_mmu_rd_acs            :    1;  /*pro_mmu_rd_acs*/
            uint32_t reg_pro_mmu_wr_acs            :    1;  /*pro_mmu_wr_acs*/
            uint32_t reserved2                     :    30;
        };
        uint32_t val;
    } cache_mmu_access_1;
    union {
        struct {
            uint32_t reg_dma_apbperi_spi2_pms_constrain_lock:    1;  /*dma_apbperi_spi2_pms_constrain_lock*/
            uint32_t reserved1                     :    31;
        };
        uint32_t val;
    } dma_apbperi_spi2_pms_constrain_0;
    union {
        struct {
            uint32_t reg_dma_apbperi_spi2_pms_constrain_sram_world_0_pms_0:    2;  /*dma_apbperi_spi2_pms_constrain_sram_world_0_pms_0*/
            uint32_t reg_dma_apbperi_spi2_pms_constrain_sram_world_0_pms_1:    2;  /*dma_apbperi_spi2_pms_constrain_sram_world_0_pms_1*/
            uint32_t reg_dma_apbperi_spi2_pms_constrain_sram_world_0_pms_2:    2;  /*dma_apbperi_spi2_pms_constrain_sram_world_0_pms_2*/
            uint32_t reg_dma_apbperi_spi2_pms_constrain_sram_world_0_pms_3:    2;  /*dma_apbperi_spi2_pms_constrain_sram_world_0_pms_3*/
            uint32_t reserved8                     :    4;
            uint32_t reg_dma_apbperi_spi2_pms_constrain_sram_world_1_pms_0:    2;  /*dma_apbperi_spi2_pms_constrain_sram_world_1_pms_0*/
            uint32_t reg_dma_apbperi_spi2_pms_constrain_sram_world_1_pms_1:    2;  /*dma_apbperi_spi2_pms_constrain_sram_world_1_pms_1*/
            uint32_t reg_dma_apbperi_spi2_pms_constrain_sram_world_1_pms_2:    2;  /*dma_apbperi_spi2_pms_constrain_sram_world_1_pms_2*/
            uint32_t reg_dma_apbperi_spi2_pms_constrain_sram_world_1_pms_3:    2;  /*dma_apbperi_spi2_pms_constrain_sram_world_1_pms_3*/
            uint32_t reserved20                    :    4;
            uint32_t reserved24                    :    8;
        };
        uint32_t val;
    } dma_apbperi_spi2_pms_constrain_1;
    union {
        struct {
            uint32_t reg_dma_apbperi_uchi0_pms_constrain_lock:    1;  /*dma_apbperi_uchi0_pms_constrain_lock*/
            uint32_t reserved1                     :    31;
        };
        uint32_t val;
    } dma_apbperi_uchi0_pms_constrain_0;
    union {
        struct {
            uint32_t reg_dma_apbperi_uchi0_pms_constrain_sram_world_0_pms_0:    2;  /*dma_apbperi_uchi0_pms_constrain_sram_world_0_pms_0*/
            uint32_t reg_dma_apbperi_uchi0_pms_constrain_sram_world_0_pms_1:    2;  /*dma_apbperi_uchi0_pms_constrain_sram_world_0_pms_1*/
            uint32_t reg_dma_apbperi_uchi0_pms_constrain_sram_world_0_pms_2:    2;  /*dma_apbperi_uchi0_pms_constrain_sram_world_0_pms_2*/
            uint32_t reg_dma_apbperi_uchi0_pms_constrain_sram_world_0_pms_3:    2;  /*dma_apbperi_uchi0_pms_constrain_sram_world_0_pms_3*/
            uint32_t reserved8                     :    4;
            uint32_t reg_dma_apbperi_uchi0_pms_constrain_sram_world_1_pms_0:    2;  /*dma_apbperi_uchi0_pms_constrain_sram_world_1_pms_0*/
            uint32_t reg_dma_apbperi_uchi0_pms_constrain_sram_world_1_pms_1:    2;  /*dma_apbperi_uchi0_pms_constrain_sram_world_1_pms_1*/
            uint32_t reg_dma_apbperi_uchi0_pms_constrain_sram_world_1_pms_2:    2;  /*dma_apbperi_uchi0_pms_constrain_sram_world_1_pms_2*/
            uint32_t reg_dma_apbperi_uchi0_pms_constrain_sram_world_1_pms_3:    2;  /*dma_apbperi_uchi0_pms_constrain_sram_world_1_pms_3*/
            uint32_t reserved20                    :    4;
            uint32_t reserved24                    :    8;
        };
        uint32_t val;
    } dma_apbperi_uchi0_pms_constrain_1;
    union {
        struct {
            uint32_t reg_dma_apbperi_i2s0_pms_constrain_lock:    1;  /*dma_apbperi_i2s0_pms_constrain_lock*/
            uint32_t reserved1                     :    31;
        };
        uint32_t val;
    } dma_apbperi_i2s0_pms_constrain_0;
    union {
        struct {
            uint32_t reg_dma_apbperi_i2s0_pms_constrain_sram_world_0_pms_0:    2;  /*dma_apbperi_i2s0_pms_constrain_sram_world_0_pms_0*/
            uint32_t reg_dma_apbperi_i2s0_pms_constrain_sram_world_0_pms_1:    2;  /*dma_apbperi_i2s0_pms_constrain_sram_world_0_pms_1*/
            uint32_t reg_dma_apbperi_i2s0_pms_constrain_sram_world_0_pms_2:    2;  /*dma_apbperi_i2s0_pms_constrain_sram_world_0_pms_2*/
            uint32_t reg_dma_apbperi_i2s0_pms_constrain_sram_world_0_pms_3:    2;  /*dma_apbperi_i2s0_pms_constrain_sram_world_0_pms_3*/
            uint32_t reserved8                     :    4;
            uint32_t reg_dma_apbperi_i2s0_pms_constrain_sram_world_1_pms_0:    2;  /*dma_apbperi_i2s0_pms_constrain_sram_world_1_pms_0*/
            uint32_t reg_dma_apbperi_i2s0_pms_constrain_sram_world_1_pms_1:    2;  /*dma_apbperi_i2s0_pms_constrain_sram_world_1_pms_1*/
            uint32_t reg_dma_apbperi_i2s0_pms_constrain_sram_world_1_pms_2:    2;  /*dma_apbperi_i2s0_pms_constrain_sram_world_1_pms_2*/
            uint32_t reg_dma_apbperi_i2s0_pms_constrain_sram_world_1_pms_3:    2;  /*dma_apbperi_i2s0_pms_constrain_sram_world_1_pms_3*/
            uint32_t reserved20                    :    4;
            uint32_t reserved24                    :    8;
        };
        uint32_t val;
    } dma_apbperi_i2s0_pms_constrain_1;
    union {
        struct {
            uint32_t reg_dma_apbperi_mac_pms_constrain_lock:    1;  /*dma_apbperi_mac_pms_constrain_lock*/
            uint32_t reserved1                     :    31;
        };
        uint32_t val;
    } dma_apbperi_mac_pms_constrain_0;
    union {
        struct {
            uint32_t reg_dma_apbperi_mac_pms_constrain_sram_world_0_pms_0:    2;  /*dma_apbperi_mac_pms_constrain_sram_world_0_pms_0*/
            uint32_t reg_dma_apbperi_mac_pms_constrain_sram_world_0_pms_1:    2;  /*dma_apbperi_mac_pms_constrain_sram_world_0_pms_1*/
            uint32_t reg_dma_apbperi_mac_pms_constrain_sram_world_0_pms_2:    2;  /*dma_apbperi_mac_pms_constrain_sram_world_0_pms_2*/
            uint32_t reg_dma_apbperi_mac_pms_constrain_sram_world_0_pms_3:    2;  /*dma_apbperi_mac_pms_constrain_sram_world_0_pms_3*/
            uint32_t reserved8                     :    4;
            uint32_t reg_dma_apbperi_mac_pms_constrain_sram_world_1_pms_0:    2;  /*dma_apbperi_mac_pms_constrain_sram_world_1_pms_0*/
            uint32_t reg_dma_apbperi_mac_pms_constrain_sram_world_1_pms_1:    2;  /*dma_apbperi_mac_pms_constrain_sram_world_1_pms_1*/
            uint32_t reg_dma_apbperi_mac_pms_constrain_sram_world_1_pms_2:    2;  /*dma_apbperi_mac_pms_constrain_sram_world_1_pms_2*/
            uint32_t reg_dma_apbperi_mac_pms_constrain_sram_world_1_pms_3:    2;  /*dma_apbperi_mac_pms_constrain_sram_world_1_pms_3*/
            uint32_t reserved20                    :    4;
            uint32_t reserved24                    :    8;
        };
        uint32_t val;
    } dma_apbperi_mac_pms_constrain_1;
    union {
        struct {
            uint32_t reg_dma_apbperi_backup_pms_constrain_lock:    1;  /*dma_apbperi_backup_pms_constrain_lock*/
            uint32_t reserved1                     :    31;
        };
        uint32_t val;
    } dma_apbperi_backup_pms_constrain_0;
    union {
        struct {
            uint32_t reg_dma_apbperi_backup_pms_constrain_sram_world_0_pms_0:    2;  /*dma_apbperi_backup_pms_constrain_sram_world_0_pms_0*/
            uint32_t reg_dma_apbperi_backup_pms_constrain_sram_world_0_pms_1:    2;  /*dma_apbperi_backup_pms_constrain_sram_world_0_pms_1*/
            uint32_t reg_dma_apbperi_backup_pms_constrain_sram_world_0_pms_2:    2;  /*dma_apbperi_backup_pms_constrain_sram_world_0_pms_2*/
            uint32_t reg_dma_apbperi_backup_pms_constrain_sram_world_0_pms_3:    2;  /*dma_apbperi_backup_pms_constrain_sram_world_0_pms_3*/
            uint32_t reserved8                     :    4;
            uint32_t reg_dma_apbperi_backup_pms_constrain_sram_world_1_pms_0:    2;  /*dma_apbperi_backup_pms_constrain_sram_world_1_pms_0*/
            uint32_t reg_dma_apbperi_backup_pms_constrain_sram_world_1_pms_1:    2;  /*dma_apbperi_backup_pms_constrain_sram_world_1_pms_1*/
            uint32_t reg_dma_apbperi_backup_pms_constrain_sram_world_1_pms_2:    2;  /*dma_apbperi_backup_pms_constrain_sram_world_1_pms_2*/
            uint32_t reg_dma_apbperi_backup_pms_constrain_sram_world_1_pms_3:    2;  /*dma_apbperi_backup_pms_constrain_sram_world_1_pms_3*/
            uint32_t reserved20                    :    4;
            uint32_t reserved24                    :    8;
        };
        uint32_t val;
    } dma_apbperi_backup_pms_constrain_1;
    union {
        struct {
            uint32_t reg_dma_apbperi_lc_pms_constrain_lock:    1;  /*dma_apbperi_lc_pms_constrain_lock*/
            uint32_t reserved1                     :    31;
        };
        uint32_t val;
    } dma_apbperi_lc_pms_constrain_0;
    union {
        struct {
            uint32_t reg_dma_apbperi_lc_pms_constrain_sram_world_0_pms_0:    2;  /*dma_apbperi_lc_pms_constrain_sram_world_0_pms_0*/
            uint32_t reg_dma_apbperi_lc_pms_constrain_sram_world_0_pms_1:    2;  /*dma_apbperi_lc_pms_constrain_sram_world_0_pms_1*/
            uint32_t reg_dma_apbperi_lc_pms_constrain_sram_world_0_pms_2:    2;  /*dma_apbperi_lc_pms_constrain_sram_world_0_pms_2*/
            uint32_t reg_dma_apbperi_lc_pms_constrain_sram_world_0_pms_3:    2;  /*dma_apbperi_lc_pms_constrain_sram_world_0_pms_3*/
            uint32_t reserved8                     :    4;
            uint32_t reg_dma_apbperi_lc_pms_constrain_sram_world_1_pms_0:    2;  /*dma_apbperi_lc_pms_constrain_sram_world_1_pms_0*/
            uint32_t reg_dma_apbperi_lc_pms_constrain_sram_world_1_pms_1:    2;  /*dma_apbperi_lc_pms_constrain_sram_world_1_pms_1*/
            uint32_t reg_dma_apbperi_lc_pms_constrain_sram_world_1_pms_2:    2;  /*dma_apbperi_lc_pms_constrain_sram_world_1_pms_2*/
            uint32_t reg_dma_apbperi_lc_pms_constrain_sram_world_1_pms_3:    2;  /*dma_apbperi_lc_pms_constrain_sram_world_1_pms_3*/
            uint32_t reserved20                    :    4;
            uint32_t reserved24                    :    8;
        };
        uint32_t val;
    } dma_apbperi_lc_pms_constrain_1;
    union {
        struct {
            uint32_t reg_dma_apbperi_aes_pms_constrain_lock:    1;  /*dma_apbperi_aes_pms_constrain_lock*/
            uint32_t reserved1                     :    31;
        };
        uint32_t val;
    } dma_apbperi_aes_pms_constrain_0;
    union {
        struct {
            uint32_t reg_dma_apbperi_aes_pms_constrain_sram_world_0_pms_0:    2;  /*dma_apbperi_aes_pms_constrain_sram_world_0_pms_0*/
            uint32_t reg_dma_apbperi_aes_pms_constrain_sram_world_0_pms_1:    2;  /*dma_apbperi_aes_pms_constrain_sram_world_0_pms_1*/
            uint32_t reg_dma_apbperi_aes_pms_constrain_sram_world_0_pms_2:    2;  /*dma_apbperi_aes_pms_constrain_sram_world_0_pms_2*/
            uint32_t reg_dma_apbperi_aes_pms_constrain_sram_world_0_pms_3:    2;  /*dma_apbperi_aes_pms_constrain_sram_world_0_pms_3*/
            uint32_t reserved8                     :    4;
            uint32_t reg_dma_apbperi_aes_pms_constrain_sram_world_1_pms_0:    2;  /*dma_apbperi_aes_pms_constrain_sram_world_1_pms_0*/
            uint32_t reg_dma_apbperi_aes_pms_constrain_sram_world_1_pms_1:    2;  /*dma_apbperi_aes_pms_constrain_sram_world_1_pms_1*/
            uint32_t reg_dma_apbperi_aes_pms_constrain_sram_world_1_pms_2:    2;  /*dma_apbperi_aes_pms_constrain_sram_world_1_pms_2*/
            uint32_t reg_dma_apbperi_aes_pms_constrain_sram_world_1_pms_3:    2;  /*dma_apbperi_aes_pms_constrain_sram_world_1_pms_3*/
            uint32_t reserved20                    :    4;
            uint32_t reserved24                    :    8;
        };
        uint32_t val;
    } dma_apbperi_aes_pms_constrain_1;
    union {
        struct {
            uint32_t reg_dma_apbperi_sha_pms_constrain_lock:    1;  /*dma_apbperi_sha_pms_constrain_lock*/
            uint32_t reserved1                     :    31;
        };
        uint32_t val;
    } dma_apbperi_sha_pms_constrain_0;
    union {
        struct {
            uint32_t reg_dma_apbperi_sha_pms_constrain_sram_world_0_pms_0:    2;  /*dma_apbperi_sha_pms_constrain_sram_world_0_pms_0*/
            uint32_t reg_dma_apbperi_sha_pms_constrain_sram_world_0_pms_1:    2;  /*dma_apbperi_sha_pms_constrain_sram_world_0_pms_1*/
            uint32_t reg_dma_apbperi_sha_pms_constrain_sram_world_0_pms_2:    2;  /*dma_apbperi_sha_pms_constrain_sram_world_0_pms_2*/
            uint32_t reg_dma_apbperi_sha_pms_constrain_sram_world_0_pms_3:    2;  /*dma_apbperi_sha_pms_constrain_sram_world_0_pms_3*/
            uint32_t reserved8                     :    4;
            uint32_t reg_dma_apbperi_sha_pms_constrain_sram_world_1_pms_0:    2;  /*dma_apbperi_sha_pms_constrain_sram_world_1_pms_0*/
            uint32_t reg_dma_apbperi_sha_pms_constrain_sram_world_1_pms_1:    2;  /*dma_apbperi_sha_pms_constrain_sram_world_1_pms_1*/
            uint32_t reg_dma_apbperi_sha_pms_constrain_sram_world_1_pms_2:    2;  /*dma_apbperi_sha_pms_constrain_sram_world_1_pms_2*/
            uint32_t reg_dma_apbperi_sha_pms_constrain_sram_world_1_pms_3:    2;  /*dma_apbperi_sha_pms_constrain_sram_world_1_pms_3*/
            uint32_t reserved20                    :    4;
            uint32_t reserved24                    :    8;
        };
        uint32_t val;
    } dma_apbperi_sha_pms_constrain_1;
    union {
        struct {
            uint32_t reg_dma_apbperi_adc_dac_pms_constrain_lock:    1;  /*dma_apbperi_adc_dac_pms_constrain_lock*/
            uint32_t reserved1                     :    31;
        };
        uint32_t val;
    } dma_apbperi_adc_dac_pms_constrain_0;
    union {
        struct {
            uint32_t reg_dma_apbperi_adc_dac_pms_constrain_sram_world_0_pms_0:    2;  /*dma_apbperi_adc_dac_pms_constrain_sram_world_0_pms_0*/
            uint32_t reg_dma_apbperi_adc_dac_pms_constrain_sram_world_0_pms_1:    2;  /*dma_apbperi_adc_dac_pms_constrain_sram_world_0_pms_1*/
            uint32_t reg_dma_apbperi_adc_dac_pms_constrain_sram_world_0_pms_2:    2;  /*dma_apbperi_adc_dac_pms_constrain_sram_world_0_pms_2*/
            uint32_t reg_dma_apbperi_adc_dac_pms_constrain_sram_world_0_pms_3:    2;  /*dma_apbperi_adc_dac_pms_constrain_sram_world_0_pms_3*/
            uint32_t reserved8                     :    4;
            uint32_t reg_dma_apbperi_adc_dac_pms_constrain_sram_world_1_pms_0:    2;  /*dma_apbperi_adc_dac_pms_constrain_sram_world_1_pms_0*/
            uint32_t reg_dma_apbperi_adc_dac_pms_constrain_sram_world_1_pms_1:    2;  /*dma_apbperi_adc_dac_pms_constrain_sram_world_1_pms_1*/
            uint32_t reg_dma_apbperi_adc_dac_pms_constrain_sram_world_1_pms_2:    2;  /*dma_apbperi_adc_dac_pms_constrain_sram_world_1_pms_2*/
            uint32_t reg_dma_apbperi_adc_dac_pms_constrain_sram_world_1_pms_3:    2;  /*dma_apbperi_adc_dac_pms_constrain_sram_world_1_pms_3*/
            uint32_t reserved20                    :    4;
            uint32_t reserved24                    :    8;
        };
        uint32_t val;
    } dma_apbperi_adc_dac_pms_constrain_1;
    union {
        struct {
            uint32_t dma_apbperi_ble_sec_pms_constrain_lock: 1;
            uint32_t reserved1:                             31;
        };
        uint32_t val;
    } dma_apbperi_ble_sec_pms_constrain_0;
    union {
        struct {
            uint32_t reg_dma_apbperi_ble_sec_pms_constrain_sram_world_0_pms_0: 2;
            uint32_t reg_dma_apbperi_ble_sec_pms_constrain_sram_world_0_pms_1: 2;
            uint32_t reg_dma_apbperi_ble_sec_pms_constrain_sram_world_0_pms_2: 2;
            uint32_t reg_dma_apbperi_ble_sec_pms_constrain_sram_world_0_pms_3: 2;
            uint32_t reserved8:                                            4;
            uint32_t reg_dma_apbperi_ble_sec_pms_constrain_sram_world_1_pms_0: 2;
            uint32_t reg_dma_apbperi_ble_sec_pms_constrain_sram_world_1_pms_1: 2;
            uint32_t reg_dma_apbperi_ble_sec_pms_constrain_sram_world_1_pms_2: 2;
            uint32_t reg_dma_apbperi_ble_sec_pms_constrain_sram_world_1_pms_3: 2;
            uint32_t reserved20:                                           4;
            uint32_t reserved24:                                           8;
        };
        uint32_t val;
    } dma_apbperi_ble_sec_pms_constrain_1;
    union {
        struct {
            uint32_t reg_dma_apbperi_white_list_pms_constrain_lock: 1;
            uint32_t reserved1:                                31;
        };
        uint32_t val;
    } dma_apbperi_white_list_pms_constrain_0;
    union {
        struct {
            uint32_t reg_dma_apbperi_white_list_pms_constrain_sram_world_0_pms_0: 2;
            uint32_t reg_dma_apbperi_white_list_pms_constrain_sram_world_0_pms_1: 2;
            uint32_t reg_dma_apbperi_white_list_pms_constrain_sram_world_0_pms_2: 2;
            uint32_t reg_dma_apbperi_white_list_pms_constrain_sram_world_0_pms_3: 2;
            uint32_t reserved8:                                               4;
            uint32_t reg_dma_apbperi_white_list_pms_constrain_sram_world_1_pms_0: 2;
            uint32_t reg_dma_apbperi_white_list_pms_constrain_sram_world_1_pms_1: 2;
            uint32_t reg_dma_apbperi_white_list_pms_constrain_sram_world_1_pms_2: 2;
            uint32_t reg_dma_apbperi_white_list_pms_constrain_sram_world_1_pms_3: 2;
            uint32_t reserved20:                                              4;
            uint32_t reserved24:                                              8;
        };
        uint32_t val;
    } dma_apbperi_white_list_pms_constrain_1;
    union {
        struct {
            uint32_t reg_dma_apbperi_sdio_host_pms_constrain_lock: 1;
            uint32_t reserved1:                               31;
        };
        uint32_t val;
    } dma_apbperi_sdio_host_pms_constrain_0;
    union {
        struct {
            uint32_t reg_dma_apbperi_sdio_host_pms_constrain_sram_world_0_pms_0: 2;
            uint32_t reg_dma_apbperi_sdio_host_pms_constrain_sram_world_0_pms_1: 2;
            uint32_t reg_dma_apbperi_sdio_host_pms_constrain_sram_world_0_pms_2: 2;
            uint32_t reg_dma_apbperi_sdio_host_pms_constrain_sram_world_0_pms_3: 2;
            uint32_t reserved8:                                              4;
            uint32_t reg_dma_apbperi_sdio_host_pms_constrain_sram_world_1_pms_0: 2;
            uint32_t reg_dma_apbperi_sdio_host_pms_constrain_sram_world_1_pms_1: 2;
            uint32_t reg_dma_apbperi_sdio_host_pms_constrain_sram_world_1_pms_2: 2;
            uint32_t reg_dma_apbperi_sdio_host_pms_constrain_sram_world_1_pms_3: 2;
            uint32_t reserved20:                                             4;
            uint32_t reserved24:                                             8;
        };
        uint32_t val;
    } dma_apbperi_sdio_host_pms_constrain_1;
    union {
        struct {
            uint32_t reg_dma_apbperi_pms_monitor_lock: 1;
            uint32_t reserved1:                   31;
        };
        uint32_t val;
    } dma_apbperi_pms_monitor_0;
    union {
        struct {
            uint32_t reg_dma_apbperi_pms_monitor_violate_clr:    1;  /*dma_apbperi_pms_monitor_violate_clr*/
            uint32_t reg_dma_apbperi_pms_monitor_violate_en:    1;  /*dma_apbperi_pms_monitor_violate_en*/
            uint32_t reserved2                     :    30;
        };
        uint32_t val;
    } dma_apbperi_pms_monitor_1;
    union {
        struct {
            uint32_t reg_dma_apbperi_pms_monitor_violate_intr:    1;  /*dma_apbperi_pms_monitor_violate_intr*/
            uint32_t reg_dma_apbperi_pms_monitor_violate_status_world:    2;  /*dma_apbperi_pms_monitor_violate_status_world*/
            uint32_t reg_dma_apbperi_pms_monitor_violate_status_addr:    24;  /*dma_apbperi_pms_monitor_violate_status_addr*/
