espressif/esp-idf/components/soc/esp32h2/include/soc/sensitive_struct.h
            uint32_t reserved27                    :    5;
        };
        uint32_t val;
    } dma_apbperi_pms_monitor_2;
    union {
        struct {
            uint32_t reg_dma_apbperi_pms_monitor_violate_status_wr:    1;  /*dma_apbperi_pms_monitor_violate_status_wr*/
            uint32_t reg_dma_apbperi_pms_monitor_violate_status_byteen:    4;  /*dma_apbperi_pms_monitor_violate_status_byteen*/
            uint32_t reserved5                     :    27;
        };
        uint32_t val;
    } dma_apbperi_pms_monitor_3;
    union {
        struct {
            uint32_t reg_core_x_iram0_dram0_dma_split_line_constrain_lock:    1;  /*core_x_iram0_dram0_dma_split_line_constrain_lock*/
            uint32_t reserved1                     :    31;
        };
        uint32_t val;
    } core_x_iram0_dram0_dma_split_line_constrain_0;
    union {
        struct {
            uint32_t reg_core_x_iram0_dram0_dma_sram_category_0:    2;  /*core_x_iram0_dram0_dma_sram_category_0*/
            uint32_t reg_core_x_iram0_dram0_dma_sram_category_1:    2;  /*core_x_iram0_dram0_dma_sram_category_1*/
            uint32_t reg_core_x_iram0_dram0_dma_sram_category_2:    2;  /*core_x_iram0_dram0_dma_sram_category_2*/
            uint32_t reserved6                     :    8;
            uint32_t reg_core_x_iram0_dram0_dma_sram_splitaddr:    8;  /*core_x_iram0_dram0_dma_sram_splitaddr*/
            uint32_t reserved22                    :    10;
        };
        uint32_t val;
    } core_x_iram0_dram0_dma_split_line_constrain_1;
    union {
        struct {
            uint32_t reg_core_x_iram0_sram_line_0_category_0:    2;  /*core_x_iram0_sram_line_0_category_0*/
            uint32_t reg_core_x_iram0_sram_line_0_category_1:    2;  /*core_x_iram0_sram_line_0_category_1*/
            uint32_t reg_core_x_iram0_sram_line_0_category_2:    2;  /*core_x_iram0_sram_line_0_category_2*/
            uint32_t reserved6                     :    8;
            uint32_t reg_core_x_iram0_sram_line_0_splitaddr:    8;  /*core_x_iram0_sram_line_0_splitaddr*/
            uint32_t reserved22                    :    10;
        };
        uint32_t val;
    } core_x_iram0_dram0_dma_split_line_constrain_2;
    union {
        struct {
            uint32_t reg_core_x_iram0_sram_line_1_category_0:    2;  /*core_x_iram0_sram_line_1_category_0*/
            uint32_t reg_core_x_iram0_sram_line_1_category_1:    2;  /*core_x_iram0_sram_line_1_category_1*/
            uint32_t reg_core_x_iram0_sram_line_1_category_2:    2;  /*core_x_iram0_sram_line_1_category_2*/
            uint32_t reserved6                     :    8;
            uint32_t reg_core_x_iram0_sram_line_1_splitaddr:    8;  /*core_x_iram0_sram_line_1_splitaddr*/
            uint32_t reserved22                    :    10;
        };
        uint32_t val;
    } core_x_iram0_dram0_dma_split_line_constrain_3;
    union {
        struct {
            uint32_t reg_core_x_dram0_dma_sram_line_0_category_0:    2;  /*core_x_dram0_dma_sram_line_0_category_0*/
            uint32_t reg_core_x_dram0_dma_sram_line_0_category_1:    2;  /*core_x_dram0_dma_sram_line_0_category_1*/
            uint32_t reg_core_x_dram0_dma_sram_line_0_category_2:    2;  /*core_x_dram0_dma_sram_line_0_category_2*/
            uint32_t reserved6                     :    8;
            uint32_t reg_core_x_dram0_dma_sram_line_0_splitaddr:    8;  /*core_x_dram0_dma_sram_line_0_splitaddr*/
            uint32_t reserved22                    :    10;
        };
        uint32_t val;
    } core_x_iram0_dram0_dma_split_line_constrain_4;
    union {
        struct {
            uint32_t reg_core_x_dram0_dma_sram_line_1_category_0:    2;  /*core_x_dram0_dma_sram_line_1_category_0*/
            uint32_t reg_core_x_dram0_dma_sram_line_1_category_1:    2;  /*core_x_dram0_dma_sram_line_1_category_1*/
            uint32_t reg_core_x_dram0_dma_sram_line_1_category_2:    2;  /*core_x_dram0_dma_sram_line_1_category_2*/
            uint32_t reserved6                     :    8;
            uint32_t reg_core_x_dram0_dma_sram_line_1_splitaddr:    8;  /*core_x_dram0_dma_sram_line_1_splitaddr*/
            uint32_t reserved22                    :    10;
        };
        uint32_t val;
    } core_x_iram0_dram0_dma_split_line_constrain_5;
    union {
        struct {
            uint32_t reg_core_x_iram0_pms_constrain_lock:    1;  /*core_x_iram0_pms_constrain_lock*/
            uint32_t reserved1                     :    31;
        };
        uint32_t val;
    } core_x_iram0_pms_constrain_0;
    union {
        struct {
            uint32_t reg_core_x_iram0_pms_constrain_sram_world_1_pms_0:    3;  /*core_x_iram0_pms_constrain_sram_world_1_pms_0*/
            uint32_t reg_core_x_iram0_pms_constrain_sram_world_1_pms_1:    3;  /*core_x_iram0_pms_constrain_sram_world_1_pms_1*/
            uint32_t reg_core_x_iram0_pms_constrain_sram_world_1_pms_2:    3;  /*core_x_iram0_pms_constrain_sram_world_1_pms_2*/
            uint32_t reg_core_x_iram0_pms_constrain_sram_world_1_pms_3:    3;  /*core_x_iram0_pms_constrain_sram_world_1_pms_3*/
            uint32_t reg_core_x_iram0_pms_constrain_sram_world_1_cachedataarray_pms_0:    3;  /*core_x_iram0_pms_constrain_sram_world_1_cachedataarray_pms_0*/
            uint32_t reserved15                    :    3;
            uint32_t reg_core_x_iram0_pms_constrain_rom_world_1_pms:    3;  /*core_x_iram0_pms_constrain_rom_world_1_pms*/
            uint32_t reserved21                    :    11;
        };
        uint32_t val;
    } core_x_iram0_pms_constrain_1;
    union {
        struct {
            uint32_t reg_core_x_iram0_pms_constrain_sram_world_0_pms_0:    3;  /*core_x_iram0_pms_constrain_sram_world_0_pms_0*/
            uint32_t reg_core_x_iram0_pms_constrain_sram_world_0_pms_1:    3;  /*core_x_iram0_pms_constrain_sram_world_0_pms_1*/
            uint32_t reg_core_x_iram0_pms_constrain_sram_world_0_pms_2:    3;  /*core_x_iram0_pms_constrain_sram_world_0_pms_2*/
            uint32_t reg_core_x_iram0_pms_constrain_sram_world_0_pms_3:    3;  /*core_x_iram0_pms_constrain_sram_world_0_pms_3*/
            uint32_t reg_core_x_iram0_pms_constrain_sram_world_0_cachedataarray_pms_0:    3;  /*core_x_iram0_pms_constrain_sram_world_0_cachedataarray_pms_0*/
            uint32_t reserved15                    :    3;
            uint32_t reg_core_x_iram0_pms_constrain_rom_world_0_pms:    3;  /*core_x_iram0_pms_constrain_rom_world_0_pms*/
            uint32_t reserved21                    :    11;
        };
        uint32_t val;
    } core_x_iram0_pms_constrain_2;
    union {
        struct {
            uint32_t reg_core_0_iram0_pms_monitor_lock:    1;  /*core_0_iram0_pms_monitor_lock*/
            uint32_t reserved1                     :    31;
        };
        uint32_t val;
    } core_0_iram0_pms_monitor_0;
    union {
        struct {
            uint32_t reg_core_0_iram0_pms_monitor_violate_clr:    1;  /*core_0_iram0_pms_monitor_violate_clr*/
            uint32_t reg_core_0_iram0_pms_monitor_violate_en:    1;  /*core_0_iram0_pms_monitor_violate_en*/
            uint32_t reserved2                     :    30;
        };
        uint32_t val;
    } core_0_iram0_pms_monitor_1;
    union {
        struct {
            uint32_t reg_core_0_iram0_pms_monitor_violate_intr:    1;  /*core_0_iram0_pms_monitor_violate_intr*/
            uint32_t reg_core_0_iram0_pms_monitor_violate_status_wr:    1;  /*core_0_iram0_pms_monitor_violate_status_wr*/
            uint32_t reg_core_0_iram0_pms_monitor_violate_status_loadstore:    1;  /*core_0_iram0_pms_monitor_violate_status_loadstore*/
            uint32_t reg_core_0_iram0_pms_monitor_violate_status_world:    2;  /*core_0_iram0_pms_monitor_violate_status_world*/
            uint32_t reg_core_0_iram0_pms_monitor_violate_status_addr:    24;  /*core_0_iram0_pms_monitor_violate_status_addr*/
            uint32_t reserved29                    :    3;
        };
        uint32_t val;
    } core_0_iram0_pms_monitor_2;
    union {
        struct {
            uint32_t reg_core_x_dram0_pms_constrain_lock:    1;  /*core_x_dram0_pms_constrain_lock*/
            uint32_t reserved1                     :    31;
        };
        uint32_t val;
    } core_x_dram0_pms_constrain_0;
    union {
        struct {
            uint32_t reg_core_x_dram0_pms_constrain_sram_world_0_pms_0:    2;  /*core_x_dram0_pms_constrain_sram_world_0_pms_0*/
            uint32_t reg_core_x_dram0_pms_constrain_sram_world_0_pms_1:    2;  /*core_x_dram0_pms_constrain_sram_world_0_pms_1*/
            uint32_t reg_core_x_dram0_pms_constrain_sram_world_0_pms_2:    2;  /*core_x_dram0_pms_constrain_sram_world_0_pms_2*/
            uint32_t reg_core_x_dram0_pms_constrain_sram_world_0_pms_3:    2;  /*core_x_dram0_pms_constrain_sram_world_0_pms_3*/
            uint32_t reserved8                     :    4;
            uint32_t reg_core_x_dram0_pms_constrain_sram_world_1_pms_0:    2;  /*core_x_dram0_pms_constrain_sram_world_1_pms_0*/
            uint32_t reg_core_x_dram0_pms_constrain_sram_world_1_pms_1:    2;  /*core_x_dram0_pms_constrain_sram_world_1_pms_1*/
            uint32_t reg_core_x_dram0_pms_constrain_sram_world_1_pms_2:    2;  /*core_x_dram0_pms_constrain_sram_world_1_pms_2*/
            uint32_t reg_core_x_dram0_pms_constrain_sram_world_1_pms_3:    2;  /*core_x_dram0_pms_constrain_sram_world_1_pms_3*/
            uint32_t reserved20                    :    4;
            uint32_t reg_core_x_dram0_pms_constrain_rom_world_0_pms:    2;  /*core_x_dram0_pms_constrain_rom_world_0_pms*/
            uint32_t reg_core_x_dram0_pms_constrain_rom_world_1_pms:    2;  /*core_x_dram0_pms_constrain_rom_world_1_pms*/
            uint32_t reserved28                    :    4;
        };
        uint32_t val;
    } core_x_dram0_pms_constrain_1;
    union {
        struct {
            uint32_t reg_core_0_dram0_pms_monitor_lock:    1;  /*core_0_dram0_pms_monitor_lock*/
            uint32_t reserved1                     :    31;
        };
        uint32_t val;
    } core_0_dram0_pms_monitor_0;
    union {
        struct {
            uint32_t reg_core_0_dram0_pms_monitor_violate_clr:    1;  /*core_0_dram0_pms_monitor_violate_clr*/
            uint32_t reg_core_0_dram0_pms_monitor_violate_en:     1;  /*core_0_dram0_pms_monitor_violate_en*/
            uint32_t reserved2                     :    30;
        };
        uint32_t val;
    } core_0_dram0_pms_monitor_1;
    union {
        struct {
            uint32_t reg_core_0_dram0_pms_monitor_violate_intr:    1;  /*core_0_dram0_pms_monitor_violate_intr*/
            uint32_t reg_core_0_dram0_pms_monitor_violate_status_lock:    1;  /*core_0_dram0_pms_monitor_violate_status_lock*/
            uint32_t reg_core_0_dram0_pms_monitor_violate_status_world:    2;  /*core_0_dram0_pms_monitor_violate_status_world*/
            uint32_t reg_core_0_dram0_pms_monitor_violate_status_addr:    24;  /*core_0_dram0_pms_monitor_violate_status_addr*/
            uint32_t reserved28                    :    4;
        };
        uint32_t val;
    } core_0_dram0_pms_monitor_2;
    union {
        struct {
            uint32_t reg_core_0_dram0_pms_monitor_violate_status_wr:    1;  /*core_0_dram0_pms_monitor_violate_status_wr*/
            uint32_t reg_core_0_dram0_pms_monitor_violate_status_byteen:    4;  /*core_0_dram0_pms_monitor_violate_status_byteen*/
            uint32_t reserved5                     :    27;
        };
        uint32_t val;
    } core_0_dram0_pms_monitor_3;
    union {
        struct {
            uint32_t reg_core_0_pif_pms_constrain_lock:    1;  /*core_0_pif_pms_constrain_lock*/
            uint32_t reserved1                     :    31;
        };
        uint32_t val;
    } core_0_pif_pms_constrain_0;
    union {
        struct {
            uint32_t reg_core_0_pif_pms_constrain_world_0_uart:    2;  /*core_0_pif_pms_constrain_world_0_uart*/
            uint32_t reg_core_0_pif_pms_constrain_world_0_g0spi_1:    2;  /*core_0_pif_pms_constrain_world_0_g0spi_1*/
            uint32_t reg_core_0_pif_pms_constrain_world_0_g0spi_0:    2;  /*core_0_pif_pms_constrain_world_0_g0spi_0*/
            uint32_t reg_core_0_pif_pms_constrain_world_0_gpio:    2;  /*core_0_pif_pms_constrain_world_0_gpio*/
            uint32_t reserved8:                                2;
            uint32_t reg_core_0_pif_pms_constrain_world_0_fe:    2;  /*core_0_pif_pms_constrain_world_0_fe*/
            uint32_t reserved12:                               2;
            uint32_t reg_core_0_pif_pms_constrain_world_0_rtc:    2;  /*core_0_pif_pms_constrain_world_0_rtc*/
            uint32_t reg_core_0_pif_pms_constrain_world_0_io_mux:    2;  /*core_0_pif_pms_constrain_world_0_io_mux*/
            uint32_t reg_core_0_pif_pms_constrain_world_0_wdg:    2;  /*core_0_pif_pms_constrain_world_0_wdg*/
            uint32_t reserved20                    :    4;
            uint32_t reg_core_0_pif_pms_constrain_world_0_misc:    2;  /*core_0_pif_pms_constrain_world_0_misc*/
            uint32_t reg_core_0_pif_pms_constrain_world_0_i2c:    2;  /*core_0_pif_pms_constrain_world_0_i2c*/
            uint32_t reserved28                    :    2;
            uint32_t reg_core_0_pif_pms_constrain_world_0_uart1:    2;  /*core_0_pif_pms_constrain_world_0_uart1*/
        };
        uint32_t val;
    } core_0_pif_pms_constrain_1;
    union {
        struct {
            uint32_t reg_core_0_pif_pms_constrain_world_0_bt:    2;  /*core_0_pif_pms_constrain_world_0_bt*/
            uint32_t reserved2                     :    2;
            uint32_t reg_core_0_pif_pms_constrain_world_0_i2c_ext0:    2;  /*core_0_pif_pms_constrain_world_0_i2c_ext0*/
            uint32_t reg_core_0_pif_pms_constrain_world_0_uhci0:    2;  /*core_0_pif_pms_constrain_world_0_uhci0*/
            uint32_t reserved8                     :    2;
            uint32_t reg_core_0_pif_pms_constrain_world_0_rmt:    2;  /*core_0_pif_pms_constrain_world_0_rmt*/
            uint32_t reserved12                    :    4;
            uint32_t reg_core_0_pif_pms_constrain_world_0_ledc:    2;  /*core_0_pif_pms_constrain_world_0_ledc*/
            uint32_t reg_core_0_pif_pms_constrain_world_0_efuse:       2;
            uint32_t reserved20:                                   2;
            uint32_t reserved22:                                   2;
            uint32_t reserved24:                                   2;
            uint32_t reg_core_0_pif_pms_constrain_world_0_timergroup:     2;
            uint32_t reg_core_0_pif_pms_constrain_world_0_timergroup1:    2;
            uint32_t reg_core_0_pif_pms_constrain_world_0_systimer:    2;
        };
        uint32_t val;
    } core_0_pif_pms_constrain_2;
    union {
        struct {
            uint32_t reg_core_0_pif_pms_constrain_world_0_spi_2:    2;  /*core_0_pif_pms_constrain_world_0_spi_2*/
            uint32_t reserved2                     :    2;
            uint32_t reg_core_0_pif_pms_constrain_world_0_apb_ctrl:    2;  /*core_0_pif_pms_constrain_world_0_apb_ctrl*/
            uint32_t reserved6                     :    4;
            uint32_t reg_core_0_pif_pms_constrain_world_0_can:    2;  /*core_0_pif_pms_constrain_world_0_can*/
            uint32_t reserved12                    :    2;
            uint32_t reg_core_0_pif_pms_constrain_world_0_i2s1:    2;  /*core_0_pif_pms_constrain_world_0_i2s1*/
            uint32_t reserved16                    :    6;
            uint32_t reg_core_0_pif_pms_constrain_world_0_rwbt:    2;  /*core_0_pif_pms_constrain_world_0_rwbt*/
            uint32_t reserved24                    :    2;
            uint32_t reserved26:                                2;
            uint32_t reserved28:                                2;
            uint32_t reserved30                    :    2;
        };
        uint32_t val;
    } core_0_pif_pms_constrain_3;
    union {
        struct {
            uint32_t reserved0                     :    2;
            uint32_t reserved2:                                    2;
            uint32_t reg_core_0_pif_pms_constrain_world_0_crypto_peri:    2;  /*core_0_pif_pms_constrain_world_0_crypto_peri*/
            uint32_t reg_core_0_pif_pms_constrain_world_0_crypto_dma:    2;  /*core_0_pif_pms_constrain_world_0_crypto_dma*/
            uint32_t reg_core_0_pif_pms_constrain_world_0_apb_adc:    2;  /*core_0_pif_pms_constrain_world_0_apb_adc*/
            uint32_t reserved10                    :    2;
            uint32_t reserved12:                                   2;
            uint32_t reg_core_0_pif_pms_constrain_world_0_usb_device:    2;  /*core_0_pif_pms_constrain_world_0_usb_device*/
            uint32_t reg_core_0_pif_pms_constrain_world_0_etm:    2;  /*core_0_pif_pms_constrain_world_0_system*/
            uint32_t reg_core_0_pif_pms_constrain_world_0_timergroup3:    2;  /*core_0_pif_pms_constrain_world_0_sensitive*/
            uint32_t reg_core_0_pif_pms_constrain_world_0_ble_sec:    2;
            uint32_t reg_core_0_pif_pms_constrain_world_0_ieee802154mac:    2;
            uint32_t reserved24:                                   2;
            uint32_t reg_core_0_pif_pms_constrain_world_0_coex:    2;
            uint32_t reg_core_0_pif_pms_constrain_world_0_rtc_ble_tmr:    2;
            uint32_t reg_core_0_pif_pms_constrain_world_0_clkrst:    2;
        };
        uint32_t val;
    } core_0_pif_pms_constrain_4;
    union {
        struct {
            uint32_t reg_core_0_pif_pms_constrain_world_0_pvt:              2;
            uint32_t reg_core_0_pif_pms_constrain_world_0_system:           2;
            uint32_t reg_core_0_pif_pms_constrain_world_0_sensitive:        2;
            uint32_t reg_core_0_pif_pms_constrain_world_0_interrupt:        2;
            uint32_t reg_core_0_pif_pms_constrain_world_0_dma_copy:         2;
            uint32_t reg_core_0_pif_pms_constrain_world_0_cache_config:     2;
            uint32_t reg_core_0_pif_pms_constrain_world_0_ad:               2;
            uint32_t reg_core_0_pif_pms_constrain_world_0_dio:              2;
            uint32_t reg_core_0_pif_pms_constrain_world_0_world_controller: 2;
            uint32_t reserved18:                                           14;
        };
        uint32_t val;
    } core_0_pif_pms_constrain_5;
    union {
        struct {
            uint32_t reg_core_0_pif_pms_constrain_world_1_uart:    2;
            uint32_t reg_core_0_pif_pms_constrain_world_1_g0spi_1: 2;
            uint32_t reg_core_0_pif_pms_constrain_world_1_g0spi_0: 2;
            uint32_t reg_core_0_pif_pms_constrain_world_1_gpio:    2;
            uint32_t reserved8:                                2;
            uint32_t reg_core_0_pif_pms_constrain_world_1_fe:      2;
            uint32_t reserved12:                               2;
            uint32_t reg_core_0_pif_pms_constrain_world_1_rtc:     2;
            uint32_t reg_core_0_pif_pms_constrain_world_1_io_mux:  2;
            uint32_t reg_core_0_pif_pms_constrain_world_1_wdg:     2;
            uint32_t reserved20:                               4;
            uint32_t reg_core_0_pif_pms_constrain_world_1_misc:    2;
            uint32_t reg_core_0_pif_pms_constrain_world_1_i2c:     2;
            uint32_t reserved28:                               2;
            uint32_t reg_core_0_pif_pms_constrain_world_1_uart1:   2;
        };
        uint32_t val;
    } core_0_pif_pms_constrain_6;
    union {
        struct {
            uint32_t reg_core_0_pif_pms_constrain_world_1_bt:          2;
            uint32_t reserved2:                                    2;
            uint32_t reg_core_0_pif_pms_constrain_world_1_i2c_ext0:    2;
            uint32_t reg_core_0_pif_pms_constrain_world_1_uhci0:       2;
            uint32_t reserved8:                                    2;
            uint32_t reg_core_0_pif_pms_constrain_world_1_rmt:         2;
            uint32_t reserved12:                                   4;
            uint32_t reg_core_0_pif_pms_constrain_world_1_ledc:        2;
            uint32_t reg_core_0_pif_pms_constrain_world_1_efuse:       2;
            uint32_t reserved20:                                   2;
            uint32_t reserved22:                                   2;
            uint32_t reserved24:                                   2;
            uint32_t reg_core_0_pif_pms_constrain_world_1_timergroup:  2;
            uint32_t reg_core_0_pif_pms_constrain_world_1_timergroup1: 2;
            uint32_t reg_core_0_pif_pms_constrain_world_1_systimer:    2;
        };
        uint32_t val;
    } core_0_pif_pms_constrain_7;
    union {
        struct {
            uint32_t reg_core_0_pif_pms_constrain_world_1_spi_2:    2;
            uint32_t reserved2:                                 2;
            uint32_t reg_core_0_pif_pms_constrain_world_1_apb_ctrl: 2;
            uint32_t reserved6:                                 4;
            uint32_t reg_core_0_pif_pms_constrain_world_1_can:      2;
            uint32_t reserved12:                                2;
            uint32_t reg_core_0_pif_pms_constrain_world_1_i2s1:     2;
            uint32_t reserved16:                                6;
            uint32_t reg_core_0_pif_pms_constrain_world_1_rwbt:     2;
            uint32_t reserved24:                                2;
            uint32_t reserved26:                                2;
            uint32_t reserved28:                                2;
            uint32_t reserved30:                                2;
        };
        uint32_t val;
    } core_0_pif_pms_constrain_8;
    union {
        struct {
            uint32_t reserved0:                                    2;
            uint32_t reserved2:                                    2;
            uint32_t reg_core_0_pif_pms_constrain_world_1_crypto_peri: 2;
            uint32_t reg_core_0_pif_pms_constrain_world_1_crypto_dma:  2;
            uint32_t reg_core_0_pif_pms_constrain_world_1_apb_adc:     2;
            uint32_t reserved10:                                   2;
            uint32_t reserved12:                                   2;
            uint32_t reg_core_0_pif_pms_constrain_world_1_usb_device:  2;
            uint32_t reg_core_0_pif_pms_constrain_world_1_etm:         2;
            uint32_t reg_core_0_pif_pms_constrain_world_1_timergroup3: 2;
            uint32_t reg_core_0_pif_pms_constrain_world_1_ble_sec:     2;
            uint32_t reg_core_0_pif_pms_constrain_world_1_ieee802154mac:   2;
            uint32_t reserved24:                                   2;
            uint32_t reg_core_0_pif_pms_constrain_world_1_coex:        2;
            uint32_t reg_core_0_pif_pms_constrain_world_1_rtc_ble_tmr: 2;
            uint32_t reg_core_0_pif_pms_constrain_world_1_clkrst:      2;
        };
        uint32_t val;
    } core_0_pif_pms_constrain_9;
    union {
        struct {
            uint32_t reg_core_0_pif_pms_constrain_world_1_pvt:              2;
            uint32_t reg_core_0_pif_pms_constrain_world_1_system:           2;
            uint32_t reg_core_0_pif_pms_constrain_world_1_sensitive:        2;
            uint32_t reg_core_0_pif_pms_constrain_world_1_interrupt:        2;
            uint32_t reg_core_0_pif_pms_constrain_world_1_dma_copy:         2;
            uint32_t reg_core_0_pif_pms_constrain_world_1_cache_config:     2;
            uint32_t reg_core_0_pif_pms_constrain_world_1_ad:               2;
            uint32_t reg_core_0_pif_pms_constrain_world_1_dio:              2;
            uint32_t reg_core_0_pif_pms_constrain_world_1_world_controller: 2;
            uint32_t reserved18:                                       14;
        };
        uint32_t val;
    } core_0_pif_pms_constrain_10;
    union {
        struct {
            uint32_t reg_core_0_pif_pms_constrain_rtcfast_spltaddr_world_0:11;
            uint32_t reg_ore_0_pif_pms_constrain_rtcfast_spltaddr_world_1:11;
            uint32_t reserved22:                                       10;
        };
        uint32_t val;
